tutorials/sandParcelChannel/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.5 0 0);
boundaryField
{
 upstream { type fixedValue; value uniform (0.5 0 0); }
 downstream { type zeroGradient; }
 bed { type noSlip; }
 lid { type slip; }
 sides { type slip; }
}
