tutorials/sandParcelChannel/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

convertToMeters 1;
vertices ((0 0 0) (1 0 0) (1 0.1 0) (0 0.1 0) (0 0 0.1) (1 0 0.1) (1 0.1 0.1) (0 0.1 0.1));
blocks (hex (0 1 2 3 4 5 6 7) (20 4 10) simpleGrading (1 1 1));
edges ();
boundary
(
 upstream { type patch; faces ((0 4 7 3)); }
 downstream { type patch; faces ((1 2 6 5)); }
 bed { type wall; faces ((0 3 2 1)); }
 lid { type wall; faces ((4 5 6 7)); }
 sides { type wall; faces ((0 1 5 4) (3 7 6 2)); }
);
mergePatchPairs ();
