tutorials/sandParcelChannel/system/controlDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object controlDict;
}

application sandParcelPimpleFoam;
startFrom startTime;
startTime 0;
stopAt endTime;
endTime 1;
deltaT 0.01;
writeControl runTime;
writeInterval 0.5;
writeFormat ascii;
writePrecision 12;
timePrecision 12;
runTimeModifiable false;
adjustTimeStep yes;
maxCo 0.5;
maxDeltaT 0.01;
